# WrongFabricSheetNumberOfWires Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..WrongFabricSheetNumberOfWires Property
BuiltInFailures..::..FabricFailures Class See Also
---
Wrong Number of Wires of the Fabric Sheet Type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongFabricSheetNumberOfWires { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongFabricSheetNumberOfWires As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongFabricSheetNumberOfWires {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace